In [2]:
import pandas as pd

> * 이번 내용은 모두 외워야 할 필요는 없지만 알고 있을 필요는 있음.
> * 함수는 필요할 때마다 찾아서 사용해도 무방함.

## Data loading

* excel file을 불러 오는 xlrd 패키지 설치<br>
`conda install --y xlrd`

In [ ]:
import numpy as np

df = pd.read_excel("C:/Users/서용득/Desktop/ML 스터디/1_data전처리_삼성전자/excel-comp-data.xlsx")
df.head()

# 파일은 교수님 깃허브에 있음

## Selection with index name and column name

In [ ]:
# 좀 직관적으로 보임
df.head(2).T

In [11]:
df[['account','street','state']].head()

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa
3   109996           155 Fadel Crescent Apt. 144          Maine
4   121213                   7274 Marissa Common     California

* `df['account']`는 Series type, `df[['account']]`는 DataFrame type

In [15]:
type(df['account'].head()), type(df[['account']].head())

(pandas.core.series.Series, pandas.core.frame.DataFrame)

* column 이름 없이 index number는 row 기준 표시

In [17]:
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [19]:
# Series type으로 3개 뽑음
df['name'][:3]

0    Kerluke, Koepp and Hilpert
1                Walter-Trantow
2    Bashirian, Kunde and Price
Name: name, dtype: object

* Series type에서 fancy indexing처럼 추출 가능

In [23]:
account_series = df['account']
account_series[list(range(0,15,2))]

0     211829
2     648336
4     121213
6     145068
8     209744
10    214098
12    242368
14    273274
Name: account, dtype: int64

In [27]:
# boolean index도 가능 (true인 값만 뽑기)
account_series[account_series < 250000]

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

* index 변경 가능

In [ ]:
df.index = df['account']
del df['account']
df.head()

* loc과 iloc중 하나만 쓰겠다고 하면 행과 열 통일시켜줘야함

In [36]:
df.loc[[211829,320563],['name','street']]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [38]:
df.iloc[:2,:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

* reindex

In [41]:
df.index = list(range(0,15))
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [46]:
# 새로운 index column을 생성
df.reset_index().head() # df가 변하지는 않음

,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

* `inplace=True`를 해주면 reset을 하든 drop을 하든 본래 df가 변함

In [ ]:
df.reset_index(inplace=True) # 본래 df가 변함

In [ ]:
df

* data drop

In [57]:
df.drop(1).head()
# df.drop(1, inplace=True)

,level_0,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,5,5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000

* axis 지정으로 축을 기준으로 drop할 수 있음 (axis의 default값이 0이므로 row가 기준임, 그래서 column을 drop할 땐 `axis=1`을 지정해줘야함)

In [56]:
df.drop('city', axis = 1).head() # city column 을 drop

,level_0,index,name,street,state,postal-code,Jan,Feb,Mar
0,0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,1,1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,4,4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000

In [ ]:
df.drop(['level_0','index'], axis = 1, inplace = True)

## DataFrame operation

* Series operation (index를 기준으로 연산 수행)

In [73]:
from pandas import Series, DataFrame
s1 = Series(range(1,6),index = list('abcde'))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [75]:
s2 = Series(range(5,11), index = list('bcedef'))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [80]:
# add 연산시 겹치는 index 값이 없으면 NaN 값으로 채워짐
s1.add(s2), s1 + s2

(a     NaN
 b     7.0
 c     9.0
 d    12.0
 e    12.0
 e    14.0
 f     NaN
 dtype: float64,
 a     NaN
 b     7.0
 c     9.0
 d    12.0
 e    12.0
 e    14.0
 f     NaN
 dtype: float64)

* DataFrame operation (index와 column을 모두 고려해서 연산 수행)
  * add, sub, div, mul 등이 있음

In [82]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns = list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [83]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns = list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [86]:
# 겹치는 index나 column 값이 없는 건 NaN값으로 채움
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [89]:
# fill_value = 0 으로 지정해주어서 NaN값이 0으로 변환
df1.add(df2, fill_value = 0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

* Series + DataFrame 연산 (axis를 기준으로 row broadcasting) 실행

In [91]:
df = DataFrame(np.arange(16).reshape(4,4), columns = list('abcd'))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [94]:
s2 = Series(np.arange(10,14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [96]:
# s2의 broadcasting은 일어나지만 겹치는 column이 없어서 전부 NaN이 됨
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [100]:
# axis = 0 을 통해 행이 겹친다는 것을 알려 줌
df.add(s2, axis = 0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

## lambda, map, apply

* map for Series
  * pandas의 Series type의 데이터에도 map 함수 사용 가능
  * function 대신 dict, sequence형 자료 등으로 대체 가능

In [101]:
s1 = Series(np.arange(5))
s1

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [103]:
s1.map(lambda x : x **2)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [105]:
# index 값이 없는 것은 NaN으로 채워짐
z = {1:'a', 2:'b', 3:'c'}
s1.map(z)

0    NaN
1      a
2      b
3      c
4    NaN
dtype: object

In [108]:
# 같은 위치의 데이터를 s2 Series로 전환
s2 = Series(np.arange(5,10))
s1.map(s2)

0    5
1    6
2    7
3    8
4    9
dtype: int32

In [110]:
df = pd.read_csv('https://raw.githubusercontent.com/TeamLab/machine_learning_from_scratch_with_python/master/code/ch4/data/wages.csv')
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [112]:
# dict를 map()로 해서 새로운 column 생성
df['sex_code'] = df.sex.map({'male':0, 'female':1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

* replace()
  * map 함수의 기능 중 데이터 변환 기능만 담당
  * 데이터 변환 시 많이 사용하는 함수

In [114]:
# dict type으로 적용
df.sex.replace({'male':0, 'female':1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [118]:
# target list, conversion list
df.sex.replace(['male','female'],[0, 1],inplace = True)
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [119]:
df.drop('sex_code', axis = 1, inplace = True)

* apply for DataFrame
  * map과 달리, Series 전체(column)에 해당 함수를 적용
  * 입력 값을 Series 데이터로 받아서 handling 가능

In [123]:
df_info = df[['earn','height','age']]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [126]:
# 각 column별로 결과값 반환
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [128]:
# 내장 연산 함수를 사용할 때도 똑같은 효과를 거둘 수 있음 (mean, std 등)
df_info.sum(), df_info.apply(sum)

(earn      4.474344e+07
 height    9.183125e+04
 age       6.250800e+04
 dtype: float64,
 earn      4.474344e+07
 height    9.183125e+04
 age       6.250800e+04
 dtype: float64)

In [130]:
# scalar값 이외에 Series의 반환도 가능
def f(x):
    return Series([x.min(), x.max()], index = ['min','max'])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

* applymap for DataFrame
  * Series 단위가 아닌 element 단위로 함수를 적용함
  * Series 단위에 apply를 적용시킬 때과 같은 효과

In [132]:
f = lambda x : -x
df_info.applymap(f).head()

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [134]:
df_info['earn'].apply(f).head()

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

## pandas built-in functions

* describe()
  * Numeric type 데이터의 요약 정보를 보여줌

In [139]:
df.describe()

                earn       height          sex           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640     0.622915    13.354605    45.328499
std     31257.070006     3.818108     0.484832     2.438741    15.789715
min       -98.580489    57.340000     0.000000     3.000000    22.000000
25%     10538.790721    63.720000     0.000000    12.000000    33.000000
50%     26877.870178    66.050000     1.000000    13.000000    42.000000
75%     44506.215336    69.315000     1.000000    15.000000    55.000000
max    317949.127955    77.210000     1.000000    18.000000    95.000000

In [145]:
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

* unique()
  * Series data의 유일한 값을 list로 반환함

In [ ]:
# race column의 값들을 0,1,2,3으로 할당해 줌
key = df.race.unique() # array로 반환
value = range(len(df.race.unique()))
df['race'].replace(to_replace = key, value = value)

* sum()
  * 기본적인 column 또는 row값의 연산을 지원
  * axis 지정 가능
  * sub, mean, min, max, count, median, mda, var 등

In [153]:
numeric_cols = ['earn','height','ed','age']
df[numeric_cols].sum(axis = 0)

earn      4.474344e+07
height    9.183125e+04
ed        1.841600e+04
age       6.250800e+04
dtype: float64

* isnull()
  * column 또는 row값에 NaN 값이 있는지 True of False로 반환함

In [151]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [152]:
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

* sort_values()
  * column 값을 기준으로 데이터를 sorting

In [155]:
# 정렬을 하면 index값이 섞임
df.sort_values(['age','earn'], ascending = True).head() # 오름차순

             earn  height  sex      race  ed  age
1038   -56.321979   67.81    0  hispanic  10   22
800    -27.876819   72.29    0     white  12   22
963    -25.655260   68.90    0     white  12   22
1105   988.565070   64.71    1     white  12   22
801   1000.221504   64.09    1     white  12   22

* corr(), cov(), corrwith() (correlation, covariance, correlation with) 
  * 상관계수, 공분산

In [157]:
df.age.corr(df.earn)

0.07400349177836056

In [159]:
# 15 초과 45 미만의 나이인 사람의 나이와 소득과의 상관계수
# 일을 할 수 있는 연령으로 제한한 것임
df.age[(df.age < 45) & (df.age > 15)].corr(df.earn)

0.31411788725189044

In [161]:
# 성별은 숫자가 아니기 때문에 숫자로 만들어주고 상관관계를 알아봄
df['sex_code'] = df['sex'].replace({'male' : 1, 'female' : 0})
df.corr()

              earn    height       sex        ed       age  sex_code
earn      1.000000  0.291600 -0.337328  0.350374  0.074003 -0.337328
height    0.291600  1.000000 -0.703672  0.114047 -0.133727 -0.703672
sex      -0.337328 -0.703672  1.000000 -0.061747  0.070036  1.000000
ed        0.350374  0.114047 -0.061747  1.000000 -0.129802 -0.061747
age       0.074003 -0.133727  0.070036 -0.129802  1.000000  0.070036
sex_code -0.337328 -0.703672  1.000000 -0.061747  0.070036  1.000000

In [163]:
# 특정 한 column과 다른 나머지 column의 상관관계 알아볼 때
df.corrwith(df.earn)

earn        1.000000
height      0.291600
sex        -0.337328
ed          0.350374
age         0.074003
sex_code   -0.337328
dtype: float64

* value_counts()
  * object type인 경우 데이터들의 갯수를 출력

In [168]:
# 남녀 비율
df.sex.value_counts(sort=True) / len(df)

1    0.622915
0    0.377085
Name: sex, dtype: float64